---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures
source: html/8b3a42ad-84f2-6eb9-3b43-50289c2efb04.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures

Failures related to part merge operations.

## Syntax (C#)
```csharp
public static class PartMakerMethodForMergePartFailures
```